---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsSupportHorizontalOffset
source: html/013fd37a-484c-6694-2bb1-0f57b3ef63a5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsSupportHorizontalOffset Property

"Lateral Offset": Distance from center or edge of boundary

## Syntax (C#)
```csharp
public static ForgeTypeId StairsSupportHorizontalOffset { get; }
```